lst = [('Александрова', 'Анна', 'Костянтинівна', 'ч', 22),
 ('Биліна', 'Олександра', 'Денисівна', 'ч', 21),
 ('Богусевич', 'Денис', 'Анатолійович', 'ж', 20),
 ('Говядін', 'Кирило', 'Олександрович', 'ж', 20),
 ('Іспірян', 'Анна', 'Самвелівна', 'ж', 20),
 ('Качуровська', 'Юлія', 'Сергіївна', 'ж', 20),
 ('Ковальчук', 'Анна', 'Миколаївна', 'ч', 21),
 ('Колко', 'Олександр', 'Олександрович', 'ч', 22),
 ('Кухарук', 'Соломія', 'Тарасівна', 'ж', 19),
 ('Міхуровська', 'Наталія', 'Іванівна', 'ж', 20),
 ('Нгуєн', 'Фу', 'Даі', 'ч', 23),
 ('Ромашко', 'Георгій', 'Романович', 'ж', 19),
 ('Соловій', 'Катерина', 'Ігорівна', 'ч', 23),
 ('Сугоняк', 'Роман', 'Ярославович', 'ч', 17),
 ('Судейко', 'Ілля', 'Юрійович', 'ж', 21),
 ('Ужвенко', 'Юлія', 'Константинівна', 'ч', 19),
 ('Чоботар', 'Максим', 'Сергійович', 'ч', 20),
 ('Чучман', 'Дмитро', 'Олександрович', 'ж', 18),
 ('Щур', 'Олександр', 'Олегович', 'ж', 23),
 ('Студент', 'Приклад', 'Надіславович', 'ж', 18),
 ('Німець', 'Надіслав', 'Вікторович', 'ч', 17)]

lst_man = {}
lst_woman = {}

for el in lst:
    sex = el[3]
    name = el[1]

    if (sex == "ч"):
        if name not in lst_man:
            lst_man[name] = 0
        else:
            lst_man[name] = lst_man[name] + 1

    elif (sex == "ж"):
        if name not in lst_woman:
            lst_woman[name] = 0
        elif name in lst_man:
            lst_woman[name] = lst_woman[name] + 1


print(f"Найбільш поширене чоловіче ім`я {max(lst_man, key=lst_man.get)}")
print(f"Найбільш поширене жіноче ім`я {max(lst_woman, key=lst_woman.get)}")